{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-COURT",
    "2": "I-COURT",
    "3": "B-PETITIONER",
    "4": "I-PETITIONER",
    "5": "B-RESPONDENT",
    "6": "I-RESPONDENT",
    "7": "B-JUDGE",
    "8": "I-JUDGE",
    "9": "B-LAWYER",
    "10": "I-LAWYER",
    "11": "B-DATE",
    "12": "I-DATE",
    "13": "B-ORG",
    "14": "I-ORG",
    "15": "B-GPE",
    "16": "I-GPE",
    "17": "B-STATUTE",
    "18": "I-STATUTE",
    "19": "B-PROVISION",
    "20": "I-PROVISION",
    "21": "B-PRECEDENT",
    "22": "I-PRECEDENT",
    "23": "B-CASE_NUMBER",
    "24": "I-CASE_NUMBER",
    "25": "B-WITNESS",
    "26": "I-WITNESS",
    "27": "B-OTHER_PERSON",
    "28": "I-OTHER_PERSON"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-CASE_NUMBER": 23,
    "B-COURT": 1,
    "B-DATE": 11,
    "B-GPE": 15,
    "B-JUDGE": 7,
    "B-LAWYER": 9,
    "B-ORG": 13,
    "B-OTHER_PERSON": 27,
    "B-PETITIONER": 3,
    "B-PRECEDENT": 21,
    "B-PROVISION": 19,
    "B-RESPONDENT": 5,
    "B-STATUTE": 17,
    "B-WITNESS": 25,
    "I-CASE_NUMBER": 24,
    "I-COURT": 2,
    "I-DATE": 12,
    "I-GPE": 16,
    "I-JUDGE": 8,
    "I-LAWYER": 10,
    "I-ORG": 14,
    "I-OTHER_PERSON": 28,
    "I-PETITIONER": 4,
    "I-PRECEDENT": 22,
    "I-PROVISION": 20,
    "I-RESPONDENT": 6,
    "I-STATUTE": 18,
    "I-WITNESS": 26,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.2.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
