{
  "add_prefix_space": true,
  "backend": "tokenizers",
  "max_length": null,
  "model_max_length": 1000000000000000019884624838656,
  "pad_to_multiple_of": null,
  "pad_token": "<pad>",
  "pad_token_type_id": 0,
  "padding_side": "right",
  "tokenizer_class": "TokenizersBackend"
}
